### Como leemos librerias en Python

import nombre_de_la_librerias as alias

In [1]:
import pandas as pd
import numpy as np
import datetime

para leer un dataframe desde un archivo CSV podemos usar el metodo read_csv de la libreria de pandas, mandando como parametro el nombre del archivo y en ocuaciones el delimitador

In [19]:
df = pd.read_csv("example_data.csv", delimiter=";")

Para imprimir el dataframe asigado a la variable de df en pandas lo podemos hacer llamando la variable pura

Como podemos acceder al diccionario de un dataframe

In [16]:
df.to_dict()['time'][1]

'2018-10-13 04:34:15.580'

Ejemplo de como construimos nuestro diccionario

In [18]:
o1 = { 
    "name": "Uayeb"
    , "lastname": "Caballero"
}

In [20]:
o1["lastname"]

'Caballero'

In [22]:
a = {
    "id": [1,2,4,5,6,7]
    , "name": ["Luis","Jose","Elminson","Rony","Rovin","Jesus"]
}

In [24]:
pd.DataFrame(a)

   id      name
0   1      Luis
1   2      Jose
2   4  Elminson
3   5      Rony
4   6     Rovin
5   7     Jesus

In [33]:
df_read_by_dict = pd.DataFrame({
    "id": [1,2,4,5,6,7]
    , "name": ["Luis","Jose","Elminson","Rony","Rovin","Jesus"]
    , "year_study" : [3,3,3,4,3,5]
})

select 
    year_study
    , count(id) as frequencia 
from df_read_by_dict
group by year_study

In [35]:
df_read_by_dict["name"]

0        Luis
1        Jose
2    Elminson
3        Rony
4       Rovin
5       Jesus
Name: name, dtype: object

In [36]:
df_read_by_dict.dtypes

id             int64
name          object
year_study     int64
dtype: object

## creacion de dataframes usando diccionarios y manipulacion de ellos

In [1]:
asignaciones = {
    'Inteligencia_Artificila': [1,0,2,4,1]
    , 'Gerencia': [3,1,3,2,0]
    , 'Arquitectura': [7,0,3,1,1]
    , 'Industria': [1,1,1,1,1]    
}

In [6]:
pd.DataFrame( asignaciones ).columns

Index(['Inteligencia_Artificila', 'Gerencia', 'Arquitectura', 'Industria'], dtype='object')

In [7]:
pd.DataFrame( asignaciones ).index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df = pd.DataFrame( asignaciones , index = ['lunes','martes','miercoles','jueves','viernes'] )

## Selecciones

In [31]:
df

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
martes                           0         1             0          1
miercoles                        2         3             3          1
jueves                           4         2             1          1
viernes                          1         0             1          1

In [52]:
df > 1

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                        False      True          True      False
martes                       False     False         False      False
miercoles                     True      True          True      False
jueves                        True      True         False      False
viernes                      False     False         False      False

inicia_en:terminamos_en-1

In [36]:
df.iloc[ 0 , 0:3 ]

Inteligencia_Artificila    1
Gerencia                   3
Arquitectura               7
Name: lunes, dtype: int64

In [46]:
df.iloc[ 1:3 , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
martes                           0         1             0          1
miercoles                        2         3             3          1

In [47]:
df.iloc[ [0,2,4] , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
miercoles                        2         3             3          1
viernes                          1         0             1          1

In [50]:
df['Gerencia'].values > 1

array([ True, False,  True,  True, False])

In [53]:
df.iloc[ [ True, False,  True,  True, False] , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
miercoles                        2         3             3          1
jueves                           4         2             1          1

In [63]:
df_filtered = df.iloc[ (df['Gerencia'].values > 1) & (df['Arquitectura'].values > 1) , 1:3 ]

In [68]:
df.iloc[ : , 1:3 ]

           Gerencia  Arquitectura
lunes             3             7
martes            1             0
miercoles         3             3
jueves            2             1
viernes           0             1

In [69]:
~( (df['Gerencia'].values > 1) & (df['Arquitectura'].values > 1) )

array([False,  True, False,  True,  True])

In [65]:
df_filtered.iloc[0,0] = 1

In [66]:
df_filtered

           Gerencia  Arquitectura
lunes             1             7
miercoles         3             3

In [67]:
df

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
martes                           0         1             0          1
miercoles                        2         3             3          1
jueves                           4         2             1          1
viernes                          1         0             1          1

## uso de loc

loc de la misma que iloc nos ayuda hacer subset de nuestros dataframes, la diferencia de este es que podemos hacer uso de los nombres de las columnas a diferencia de iloc, como nombre lo indica *i = index*

In [2]:
dataframe_size = 100

In [3]:
np.random.seed(111)

In [4]:
x = pd.DataFrame(
    {
        'id' : [ np.random.randint(20) for x in range(dataframe_size) ]
        , 'fecha' : [ np.random.choice( pd.date_range( end = datetime.date( 2022 , 2 , 24 ) , freq='1W' , periods=10  )) for x in range(100) ]
        , 'notas': np.random.rand(dataframe_size)
        , 'scholarship': [ np.random.choice([True,False]) for x in range(dataframe_size) ]
    }
)

In [189]:
[ np.random.choice([True,False]) for x in range(5) ]

[True, False, True, True, False]

In [190]:
[ np.random.randint(1000) for x in range(5) ]

[369, 318, 262, 804, 42]

In [194]:
pd.date_range( end = datetime.date( 2022 , 2 , 24 ) , freq='1W' , periods=10  )

DatetimeIndex(['2021-12-19', '2021-12-26', '2022-01-02', '2022-01-09',
               '2022-01-16', '2022-01-23', '2022-01-30', '2022-02-06',
               '2022-02-13', '2022-02-20'],
              dtype='datetime64[ns]', freq='W-SUN')

In [29]:
y = x.loc[ ( x['notas'] < 0.4) & ( x['scholarship'] )  , ['id','fecha']   ]

In [30]:
y.shape[0] / x.shape[0]

0.21

In [25]:
x.loc[ : , ['fecha'] ].drop_duplicates().shape

(10, 1)

In [47]:
x.loc[ :, ["id","fecha"] ].groupby( ["id"] , as_index = False ).count()

    id  fecha
0    0      5
1    1      4
2    2      4
3    3      3
4    4      4
5    5      9
6    6      5
7    7      9
8    8      6
9    9      7
10  10      7
11  11      6
12  12      7
13  13      6
14  14      5
15  16      2
16  17      3
17  18      5
18  19      3

In [48]:
x.loc[ :, ["id","fecha"] ].groupby( ["id"] , as_index = False ).count().columns

Index(['id', 'fecha'], dtype='object')

In [60]:
xx = x.groupby( ["id"] , as_index=False ).agg( { "fecha" : ["count"] , "notas": ["max","min"]  } )

Select 
    id
    , count(fechas) as conteo_de_eventos
    , max(notas) as max_nota
    , min(notas) as min_notas
from x
group by id

In [57]:
xx.columns = xx.columns.droplevel(1)

In [67]:
as_scholarship = x.groupby( ["id","scholarship"] problem, as_index = False ).agg( { "fecha":["count"] } )

In [68]:
problemas_scholarship.columns = problemas_scholarship.columns.droplevel(1)

In [79]:
problemas_scholarship = problemas_scholarship.loc[:,["id","scholarship"]].groupby( ["id"] ,as_index = False ).count()

In [89]:
problemas_scholarship.loc[ problemas_scholarship['scholarship'] == 2 , : ]

    id  scholarship
0    0            2
1    1            2
3    3            2
4    4            2
5    5            2
6    6            2
7    7            2
8    8            2
9    9            2
10  10            2
11  11            2
12  12            2
13  13            2
14  14            2
17  18            2

In [91]:
problemas_scholarship.loc[ problemas_scholarship['scholarship'] == 2 , : ].shape[0] / x.loc[ :  , ["id"] ].drop_duplicates().shape[0]

0.7894736842105263

In [92]:
x

    id      fecha     notas  scholarship
0   12 2021-12-26  0.265306        False
1   19 2021-12-19  0.901838        False
2    9 2022-01-02  0.818264        False
3    2 2021-12-26  0.399233         True
4   18 2022-01-02  0.820285         True
..  ..        ...       ...          ...
95  10 2022-02-13  0.127540         True
96  14 2021-12-26  0.940140         True
97   7 2022-02-20  0.877717         True
98   3 2021-12-26  0.699509        False
99   8 2022-02-20  0.936895         True

[100 rows x 4 columns]

In [94]:
x.loc[ x["id"] == 9 , : ].sort_values(["fecha"])

    id      fecha     notas  scholarship
43   9 2021-12-19  0.850703        False
29   9 2021-12-26  0.475809        False
2    9 2022-01-02  0.818264        False
82   9 2022-01-23  0.393110         True
50   9 2022-01-30  0.828130         True
66   9 2022-02-13  0.604551        False
89   9 2022-02-13  0.515202        False